# all(колекція) — повертає True, якщо абсолютно всі елементи в колекції дорівнюють True (або є "правдивими"). 
# Якщо хоч один елемент False — підсумок False.

# any(колекція) — повертає True, якщо хоча б один елемент у колекції дорівнює True. 
# Якщо всі False — підсумок False.

print("--------all(), any()--------")

# Варіант 1: Усі відповіді правильні
round_1 = [True, True, True, True]

print(all(round_1))  # True (Усі відповіді вірні! Ідеальний раунд!)
print(any(round_1))  # True (Чи є хоч одна правильна? Так)

# Варіант 2: Одна помилка
round_2 = [True, False, True, True]

print(all(round_2))  # False (Не всі відповіді вірні, ідеального раунду немає)
print(any(round_2))  # True (Хоч одна правильна відповідь є)

# Варіант 3: Жодної правильної відповіді
round_3 = [False, False, False]

print(all(round_3))  # False (Усі відповіді не вірні)
print(any(round_3))  # False (Жодної правильної)

print("--------map() with all()--------")

# Наприклад, перевірити, чи учень набрав у кожному раунді більше ніж 50 балів:
scores = [60, 80, 55, 90]

# Спочатку отримуємо список True/False за допомогою map та lambda:
is_above_50 = map(lambda score: score > 50, scores)

# Перевіряємо, чи всі бали > 50:
print(all(is_above_50)) # True


# Чому ж тоді all([]) повертає True?

# Це магічна логіка, яка називається вакуумною істиною (Vacuous Truth):

# Функція all() шукає хоча б один елемент, який дорівнює False. Якщо вона його не знаходить — вона повертає True. 
# Оскільки в порожньому списку [] немає жодного False (бо там взагалі немає елементів).
# all() вважає умову виконаною і повертає True.

# А от any([]) шукає хоча б один True. У порожньому списку його немає, тому any([]) поверне False.